perf-test/results/02-snapshot-jmeter.log
2026-08-18 14:33:39,534 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-18 14:33:39,547 INFO o.a.j.JMeter: Loading user properties from: D:\tools\apache-jmeter-5.6.3\bin\user.properties
2026-08-18 14:33:39,548 INFO o.a.j.JMeter: Loading system properties from: D:\tools\apache-jmeter-5.6.3\bin\system.properties
2026-08-18 14:33:39,551 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-18 14:33:39,551 INFO o.a.j.JMeter: Version 5.6.3
2026-08-18 14:33:39,551 INFO o.a.j.JMeter: java.version=21.0.10
2026-08-18 14:33:39,552 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-08-18 14:33:39,552 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-18 14:33:39,552 INFO o.a.j.JMeter: os.arch=amd64
2026-08-18 14:33:39,554 INFO o.a.j.JMeter: os.version=10.0
2026-08-18 14:33:39,554 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-18 14:33:39,554 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-18 14:33:39,554 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-18 14:33:39,554 INFO o.a.j.JMeter: Available Processors =24
2026-08-18 14:33:39,558 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-18 14:33:39,558 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-18 14:33:39,559 INFO o.a.j.JMeter: JMeterHome=D:\tools\apache-jmeter-5.6.3
2026-08-18 14:33:39,559 INFO o.a.j.JMeter: user.dir  =D:\sm-console\perf-test
2026-08-18 14:33:39,559 INFO o.a.j.JMeter: PWD       =D:\sm-console\perf-test
2026-08-18 14:33:44,513 INFO o.a.j.JMeter: IP: 192.168.56.1 Name: ICT02-15 FullName: ICT02-15
2026-08-18 14:33:44,521 INFO o.a.j.s.FileServer: Default base='D:\sm-console\perf-test'
2026-08-18 14:33:44,521 INFO o.a.j.s.FileServer: Set new base='D:\sm-console\perf-test'
2026-08-18 14:33:44,633 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-18 14:33:44,654 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-18 14:33:44,655 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-18 14:33:44,658 INFO o.a.j.s.SaveService: Loading file: 02-snapshot-stats.jmx
2026-08-18 14:33:44,694 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:33:44,694 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:33:44,694 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:33:44,694 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:33:44,694 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-18 14:33:44,694 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-18 14:33:44,716 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-18 14:33:44,732 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-18 14:33:44,732 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 14:33:44,732 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 14:33:44,735 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-18 14:33:44,735 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-18 14:33:44,781 INFO o.a.j.JMeter: Running test (1787031224780)
2026-08-18 14:33:44,791 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 50 Users - Snapshot Stats
2026-08-18 14:33:44,791 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group 50 Users - Snapshot Stats.
2026-08-18 14:33:44,791 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-18 14:33:44,791 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=10 delayedStart=false
2026-08-18 14:33:44,799 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-1
2026-08-18 14:33:44,812 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-18 14:33:44,813 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-18 14:33:44,816 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ICT02-15
2026-08-18 14:33:44,822 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-18 14:33:44,824 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-18 14:33:44,824 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-18 14:33:44,824 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-18 14:33:44,824 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-18 14:33:44,998 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-2
2026-08-18 14:33:45,040 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-1
2026-08-18 14:33:45,040 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-1
2026-08-18 14:33:45,090 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-2
2026-08-18 14:33:45,090 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-2
2026-08-18 14:33:45,197 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-3
2026-08-18 14:33:45,287 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-3
2026-08-18 14:33:45,287 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-3
2026-08-18 14:33:45,396 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-4
2026-08-18 14:33:45,489 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-4
2026-08-18 14:33:45,489 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-4
2026-08-18 14:33:45,593 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-5
2026-08-18 14:33:45,687 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-5
2026-08-18 14:33:45,687 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-5
2026-08-18 14:33:45,794 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-6
2026-08-18 14:33:45,917 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-6
2026-08-18 14:33:45,917 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-6
2026-08-18 14:33:45,993 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-7
2026-08-18 14:33:46,090 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-7
2026-08-18 14:33:46,090 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-7
2026-08-18 14:33:46,194 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-8
2026-08-18 14:33:46,289 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-8
2026-08-18 14:33:46,289 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-8
2026-08-18 14:33:46,393 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-9
2026-08-18 14:33:46,485 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-9
2026-08-18 14:33:46,485 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-9
2026-08-18 14:33:46,593 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-10
2026-08-18 14:33:46,678 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-10
2026-08-18 14:33:46,678 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-10
2026-08-18 14:33:46,793 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-11
2026-08-18 14:33:46,885 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-11
2026-08-18 14:33:46,885 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-11
2026-08-18 14:33:46,991 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-12
2026-08-18 14:33:47,083 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-12
2026-08-18 14:33:47,084 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-12
2026-08-18 14:33:47,198 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-13
2026-08-18 14:33:47,289 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-13
2026-08-18 14:33:47,289 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-13
2026-08-18 14:33:47,393 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-14
2026-08-18 14:33:47,477 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-14
2026-08-18 14:33:47,477 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-14
2026-08-18 14:33:47,592 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-15
2026-08-18 14:33:47,672 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-15
2026-08-18 14:33:47,672 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-15
2026-08-18 14:33:47,792 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-16
2026-08-18 14:33:47,875 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-16
2026-08-18 14:33:47,875 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-16
2026-08-18 14:33:48,004 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-17
2026-08-18 14:33:48,088 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-17
2026-08-18 14:33:48,088 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-17
2026-08-18 14:33:48,195 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-18
2026-08-18 14:33:48,285 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-18
2026-08-18 14:33:48,285 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-18
2026-08-18 14:33:48,392 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-19
2026-08-18 14:33:48,474 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-19
2026-08-18 14:33:48,474 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-19
2026-08-18 14:33:48,592 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-20
2026-08-18 14:33:48,676 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-20
2026-08-18 14:33:48,676 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-20
2026-08-18 14:33:48,793 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-21
2026-08-18 14:33:48,875 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-21
2026-08-18 14:33:48,875 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-21
2026-08-18 14:33:48,992 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-22
2026-08-18 14:33:49,075 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-22
2026-08-18 14:33:49,075 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-22
2026-08-18 14:33:49,193 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-23
2026-08-18 14:33:49,274 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-23
2026-08-18 14:33:49,274 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-23
2026-08-18 14:33:49,392 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-24
2026-08-18 14:33:49,472 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-24
2026-08-18 14:33:49,472 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-24
2026-08-18 14:33:49,592 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-25
2026-08-18 14:33:49,690 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-25
2026-08-18 14:33:49,690 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-25
2026-08-18 14:33:49,794 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-26
2026-08-18 14:33:49,878 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-26
2026-08-18 14:33:49,879 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-26
2026-08-18 14:33:49,993 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-27
2026-08-18 14:33:50,085 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-27
2026-08-18 14:33:50,085 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-27
2026-08-18 14:33:50,192 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-28
2026-08-18 14:33:50,270 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-28
2026-08-18 14:33:50,270 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-28
2026-08-18 14:33:50,392 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-29
2026-08-18 14:33:50,468 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-29
2026-08-18 14:33:50,468 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-29
2026-08-18 14:33:50,592 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-30
2026-08-18 14:33:50,670 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-30
2026-08-18 14:33:50,670 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-30
2026-08-18 14:33:50,792 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-31
2026-08-18 14:33:50,875 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-31
2026-08-18 14:33:50,875 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-31
2026-08-18 14:33:50,992 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-32
2026-08-18 14:33:51,072 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-32
2026-08-18 14:33:51,072 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-32
2026-08-18 14:33:51,192 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-33
2026-08-18 14:33:51,275 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-33
2026-08-18 14:33:51,275 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-33
2026-08-18 14:33:51,393 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-34
2026-08-18 14:33:51,469 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-34
2026-08-18 14:33:51,469 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-34
2026-08-18 14:33:51,593 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-35
2026-08-18 14:33:51,671 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-35
2026-08-18 14:33:51,671 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-35
2026-08-18 14:33:51,793 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-36
2026-08-18 14:33:51,870 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-36
2026-08-18 14:33:51,871 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-36
2026-08-18 14:33:51,994 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-37
2026-08-18 14:33:52,074 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-37
2026-08-18 14:33:52,075 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-37
2026-08-18 14:33:52,191 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-38
2026-08-18 14:33:52,268 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-38
2026-08-18 14:33:52,268 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-38
2026-08-18 14:33:52,391 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-39
2026-08-18 14:33:52,473 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-39
2026-08-18 14:33:52,473 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-39
2026-08-18 14:33:52,591 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-40
2026-08-18 14:33:52,668 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-40
2026-08-18 14:33:52,668 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-40
2026-08-18 14:33:52,791 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-41
2026-08-18 14:33:52,872 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-41
2026-08-18 14:33:52,872 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-41
2026-08-18 14:33:52,992 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-42
2026-08-18 14:33:53,074 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-42
2026-08-18 14:33:53,074 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-42
2026-08-18 14:33:53,193 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-43
2026-08-18 14:33:53,270 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-43
2026-08-18 14:33:53,270 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-43
2026-08-18 14:33:53,391 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-44
2026-08-18 14:33:53,468 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-44
2026-08-18 14:33:53,468 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-44
2026-08-18 14:33:53,592 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-45
2026-08-18 14:33:53,670 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-45
2026-08-18 14:33:53,670 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-45
2026-08-18 14:33:53,792 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-46
2026-08-18 14:33:53,870 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-46
2026-08-18 14:33:53,870 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-46
2026-08-18 14:33:53,992 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-47
2026-08-18 14:33:54,076 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-47
2026-08-18 14:33:54,076 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-47
2026-08-18 14:33:54,192 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-48
2026-08-18 14:33:54,275 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-48
2026-08-18 14:33:54,275 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-48
2026-08-18 14:33:54,392 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-49
2026-08-18 14:33:54,472 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-49
2026-08-18 14:33:54,472 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-49
2026-08-18 14:33:54,594 INFO o.a.j.t.JMeterThread: Thread started: 50 Users - Snapshot Stats 1-50
2026-08-18 14:33:54,674 INFO o.a.j.t.JMeterThread: Thread is done: 50 Users - Snapshot Stats 1-50
2026-08-18 14:33:54,674 INFO o.a.j.t.JMeterThread: Thread finished: 50 Users - Snapshot Stats 1-50
2026-08-18 14:33:54,674 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-18 14:33:54,675 INFO o.a.j.r.Summariser: summary =    550 in 00:00:10 =   55.6/s Avg:     7 Min:     1 Max:    97 Err:     0 (0.00%)