perf-test/results/03-jmeter.log
2026-08-18 14:24:07,809 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-18 14:24:07,820 INFO o.a.j.JMeter: Loading user properties from: D:\tools\apache-jmeter-5.6.3\bin\user.properties
2026-08-18 14:24:07,821 INFO o.a.j.JMeter: Loading system properties from: D:\tools\apache-jmeter-5.6.3\bin\system.properties
2026-08-18 14:24:07,825 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-18 14:24:07,825 INFO o.a.j.JMeter: Version 5.6.3
2026-08-18 14:24:07,825 INFO o.a.j.JMeter: java.version=21.0.10
2026-08-18 14:24:07,825 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-08-18 14:24:07,825 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-18 14:24:07,825 INFO o.a.j.JMeter: os.arch=amd64
2026-08-18 14:24:07,826 INFO o.a.j.JMeter: os.version=10.0
2026-08-18 14:24:07,826 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-18 14:24:07,826 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-18 14:24:07,826 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-18 14:24:07,826 INFO o.a.j.JMeter: Available Processors =24
2026-08-18 14:24:07,833 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-18 14:24:07,833 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-18 14:24:07,833 INFO o.a.j.JMeter: JMeterHome=D:\tools\apache-jmeter-5.6.3
2026-08-18 14:24:07,833 INFO o.a.j.JMeter: user.dir  =D:\sm-console\perf-test
2026-08-18 14:24:07,833 INFO o.a.j.JMeter: PWD       =D:\sm-console\perf-test
2026-08-18 14:24:12,791 INFO o.a.j.JMeter: IP: 192.168.56.1 Name: ICT02-15 FullName: ICT02-15
2026-08-18 14:24:12,798 INFO o.a.j.s.FileServer: Default base='D:\sm-console\perf-test'
2026-08-18 14:24:12,799 INFO o.a.j.s.FileServer: Set new base='D:\sm-console\perf-test'
2026-08-18 14:24:12,948 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-18 14:24:12,971 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-18 14:24:12,975 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-18 14:24:12,977 INFO o.a.j.s.SaveService: Loading file: 03-webhook-load.jmx
2026-08-18 14:24:13,019 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:24:13,019 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:24:13,019 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:24:13,019 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-18 14:24:13,019 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-18 14:24:13,019 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-18 14:24:13,037 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-18 14:24:13,052 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-18 14:24:13,053 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 14:24:13,053 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-18 14:24:13,056 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-18 14:24:13,056 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-18 14:24:13,102 INFO o.a.j.JMeter: Running test (1787030653102)
2026-08-18 14:24:13,117 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 30 Concurrent Webhook Callers
2026-08-18 14:24:13,117 INFO o.a.j.e.StandardJMeterEngine: Starting 30 threads for group 30 Concurrent Webhook Callers.
2026-08-18 14:24:13,117 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-18 14:24:13,117 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=30 ramp-up=5 delayedStart=false
2026-08-18 14:24:13,130 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-18 14:24:13,130 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-18 14:24:13,184 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-1
2026-08-18 14:24:13,185 INFO o.a.j.s.FileServer: Stored: data/severities.csv
2026-08-18 14:24:13,212 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ICT02-15
2026-08-18 14:24:13,217 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-18 14:24:13,219 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-18 14:24:13,219 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-18 14:24:13,219 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-18 14:24:13,219 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-18 14:24:13,348 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-2
2026-08-18 14:24:13,466 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-2
2026-08-18 14:24:13,466 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-2
2026-08-18 14:24:13,467 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-1
2026-08-18 14:24:13,467 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-1
2026-08-18 14:24:13,515 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-3
2026-08-18 14:24:13,555 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-3
2026-08-18 14:24:13,555 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-3
2026-08-18 14:24:13,683 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-4
2026-08-18 14:24:13,724 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-4
2026-08-18 14:24:13,724 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-4
2026-08-18 14:24:13,848 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-5
2026-08-18 14:24:13,888 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-5
2026-08-18 14:24:13,888 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-5
2026-08-18 14:24:14,015 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-6
2026-08-18 14:24:14,057 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-6
2026-08-18 14:24:14,058 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-6
2026-08-18 14:24:14,184 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-7
2026-08-18 14:24:14,231 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-7
2026-08-18 14:24:14,231 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-7
2026-08-18 14:24:14,348 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-8
2026-08-18 14:24:14,401 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-8
2026-08-18 14:24:14,401 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-8
2026-08-18 14:24:14,515 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-9
2026-08-18 14:24:14,569 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-9
2026-08-18 14:24:14,569 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-9
2026-08-18 14:24:14,681 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-10
2026-08-18 14:24:14,722 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-10
2026-08-18 14:24:14,722 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-10
2026-08-18 14:24:14,848 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-11
2026-08-18 14:24:14,898 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-11
2026-08-18 14:24:14,898 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-11
2026-08-18 14:24:15,013 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-12
2026-08-18 14:24:15,052 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-12
2026-08-18 14:24:15,052 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-12
2026-08-18 14:24:15,179 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-13
2026-08-18 14:24:15,225 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-13
2026-08-18 14:24:15,226 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-13
2026-08-18 14:24:15,347 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-14
2026-08-18 14:24:15,413 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-14
2026-08-18 14:24:15,413 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-14
2026-08-18 14:24:15,514 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-15
2026-08-18 14:24:15,551 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-15
2026-08-18 14:24:15,551 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-15
2026-08-18 14:24:15,679 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-16
2026-08-18 14:24:15,720 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-16
2026-08-18 14:24:15,720 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-16
2026-08-18 14:24:15,847 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-17
2026-08-18 14:24:15,885 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-17
2026-08-18 14:24:15,885 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-17
2026-08-18 14:24:16,014 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-18
2026-08-18 14:24:16,068 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-18
2026-08-18 14:24:16,068 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-18
2026-08-18 14:24:16,182 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-19
2026-08-18 14:24:16,221 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-19
2026-08-18 14:24:16,221 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-19
2026-08-18 14:24:16,347 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-20
2026-08-18 14:24:16,382 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-20
2026-08-18 14:24:16,382 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-20
2026-08-18 14:24:16,514 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-21
2026-08-18 14:24:16,555 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-21
2026-08-18 14:24:16,556 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-21
2026-08-18 14:24:16,680 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-22
2026-08-18 14:24:16,720 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-22
2026-08-18 14:24:16,720 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-22
2026-08-18 14:24:16,847 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-23
2026-08-18 14:24:16,893 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-23
2026-08-18 14:24:16,893 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-23
2026-08-18 14:24:17,014 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-24
2026-08-18 14:24:17,053 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-24
2026-08-18 14:24:17,054 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-24
2026-08-18 14:24:17,181 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-25
2026-08-18 14:24:17,221 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-25
2026-08-18 14:24:17,221 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-25
2026-08-18 14:24:17,347 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-26
2026-08-18 14:24:17,386 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-26
2026-08-18 14:24:17,386 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-26
2026-08-18 14:24:17,515 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-27
2026-08-18 14:24:17,551 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-27
2026-08-18 14:24:17,552 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-27
2026-08-18 14:24:17,680 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-28
2026-08-18 14:24:17,735 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-28
2026-08-18 14:24:17,735 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-28
2026-08-18 14:24:17,846 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-29
2026-08-18 14:24:17,881 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-29
2026-08-18 14:24:17,881 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-29
2026-08-18 14:24:18,014 INFO o.a.j.t.JMeterThread: Thread started: 30 Concurrent Webhook Callers 1-30
2026-08-18 14:24:18,117 INFO o.a.j.t.JMeterThread: Thread is done: 30 Concurrent Webhook Callers 1-30
2026-08-18 14:24:18,117 INFO o.a.j.t.JMeterThread: Thread finished: 30 Concurrent Webhook Callers 1-30
2026-08-18 14:24:18,117 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-18 14:24:18,118 INFO o.a.j.s.FileServer: Close: data/severities.csv
2026-08-18 14:24:18,121 INFO o.a.j.r.Summariser: summary =    150 in 00:00:05 =   29.9/s Avg:     9 Min:     5 Max:   134 Err:     0 (0.00%)